{\rtf1\ansi\ansicpg1252\cocoartf2821
\cocoatextscaling0\cocoaplatform0{\fonttbl\f0\fswiss\fcharset0 Helvetica;}
{\colortbl;\red255\green255\blue255;}
{\*\expandedcolortbl;;}
\margl1440\margr1440\vieww11520\viewh8400\viewkind0
\pard\tx720\tx1440\tx2160\tx2880\tx3600\tx4320\tx5040\tx5760\tx6480\tx7200\tx7920\tx8640\pardirnatural\partightenfactor0

\f0\fs24 \cf0 \{\
  "id": "start",\
  "text": [\
    "\uc0唵8 嚀8  Scene: Welcome to the ER \'97 Please Take a Number",\
    "It didn't start with an ambulance. It started with a year of gaslighting.",\
    "You were a good patient. You went to every appointment, even when you had to leave work early, bike two hours with your stomach in knots, or beg friends for rides.",\
    "You tolerated it all \'97 the rotating cast of medical residents who never read your chart, the endless loop of 'eat more fiber,' 'take Miralax,' 'do yoga,' and the cherry on top: 'Are you here for drugs?'",\
    "You told them, every time: 'This is NOT a case of IBS. I'm an ultramarathon runner. I eat like a vegan wellness influencer. I've taken everything you've prescribed \'97 multiple times \'97 as written. And I'm still in agony.'",\
    "They nodded sympathetically and prescribed a different flavor of useless.",\
    "You worked at a 3D printing company. Finally\'97decent insurance. Stanford Hospital was twenty minutes away. The GI clinic was walking distance from your job. You thought that meant something.",\
    "It didn't.",\
    "Stanford gave you the same shrugs and suspicion that Medi-Cal did \'97 just with nicer furniture.",\
    "After months of vomiting, bloating so severe none of your clothes fit, and appointments that went nowhere, you stopped hoping. You started surviving.",\
    "You stayed late in the lab to make up for time lost to vomiting in your car or sprinting to the bathroom mid-client meeting. You popped antiemetics like mints \'97 which you'd been on since middle school, by the way, because this didn\'92t start last year. This started decades ago.",\
    "Rather than sympathy and help, fighting the urge to not throw up in the middle of meetings (and often failing) earned you the label of 'unreliable employee'.",\
    "It\'92s not long before your boss\'97who comes into the office three hours a week and is impossible to reach\'97puts you on a PIP for 'performance concerns.'",\
    "Then came the night everything broke.",\
    "You wake up at 3am. Your stomach feels like it\'92s trying to detonate inside your body. You're doubled over, drenched in sweat, moaning through clenched teeth.",\
    "The pressure. The nausea. You can\'92t walk. You can\'92t even sit up. You whisper to your partner: 'Call 911.'",\
    "The paramedics arrive. And immediately start asking if you're pregnant.",\
    "Your partner tries to explain. You try to scream. But your abdomen is so distended it looks like you swallowed a basketball whole."\
  ],\
  "choices": [\
    \{\
      "text": "\uc0唵7 嚗7  Stay in the ambulance and go to the ER",\
      "nextId": "er_arrival"\
    \},\
    \{\
      "text": "\uc0唵6 在3 舅 鞒 攃9  Bail out of the ambulance and go back upstairs",\
      "nextId": "escape_ambulance"\
    \}\
  ],\
  "resources": [\
    \{\
      "title": "Understanding Medical Gaslighting",\
      "url": "https://www.healthline.com/health/medical-gaslighting"\
    \},\
    \{\
      "title": "Your Rights at Work with Chronic Illness",\
      "url": "https://askjan.org/topics/chronic.cfm"\
    \}\
  ],\
  "navigation": [\
    \{\
      "text": "\uc0唵7 噗7  Start this story over from the beginning",\
      "nextId": "start"\
    \},\
    \{\
      "text": "\uc0唵6 圱2  Return to Main Menu",\
      "nextId": "main-menu"\
    \}\
  ]\
\}\
}