{
  "start": {
    "id": "start",
    "text": [
      "It didn’t start with an ambulance. It started with pain. Not just any pain — character development pain. The kind that wakes you up at 3am, folds you in half like a crusty yoga mat, and whispers, “Good luck, bitch.”",
      "You were a 'good patient,' remember? You played the game. You did the fiber. The yoga. The low FODMAP sad beige diet. You smiled through the lectures, the pamphlets, the 'have you tried breathing?' energy. You even kept your voice calm while the 12-year-old resident explained your own body to you like he was giving a TED Talk called 'It’s Just IBS, Sweetheart.'",
      "You’re not a doctor, but you are a PhD in physics with decades of lived experience in 'something is very wrong with my stomach and no one believes me.' You’ve worked in high-tech labs, helped launch 3D-printed medical devices, and now? You’re curled in the fetal position, vibrating like a dying Roomba, covered in flop sweat and regret.",
      "You haven’t eaten in three days. A bite of yogurt sent you into a full-body exorcism. Even water is playing hard to get.",
      "Your boss at the 3D printing job — the same one who praised you when you worked through fevers and nausea — called you lazy and put you on a PIP for daring to deteriorate. Because chronic illness makes you unproductive, and unproductive is unacceptable.",
      "Your partner tiptoes in, haunted. 'Do you think it’s time to go to the ER?'",
      "You nod. The Go Bag is already packed."
    ],
    "choices": [
      {
        "text": "🚑 Tell him to call 911, because your legs don’t work and your soul has already left the building.\nYou’ll have to deal with whatever sentient jar of mayonnaise shows up in uniform — but at this point, who cares?",
        "nextId": "call_911"
      },
      {
        "text": "🚗 Let him drive you — which is only slightly less dangerous than letting a squirrel operate a forklift.\nHe’s also chronically ill. He can’t sit upright for more than ten minutes without needing two weeks of recovery and a priest. But he’d do it. For you.",
        "nextId": "partner_drive"
      },
      {
        "text": "🛁 Refuse both. Try to tough it out. Die on the bathroom floor like a true wellness girlie.\nMaybe drag out that crusty yoga mat from under the bed. Pretend it’s helping. Try not to aspirate your own stomach acid. Spoiler: you’ll end up needing 911 anyway.",
        "nextId": "bathroom_floor"
      }
    ],
    "resources": [
      {
        "title": "Understanding Medical Gaslighting",
        "url": "https://www.healthline.com/health/medical-gaslighting"
      },
      {
        "title": "Patient Advocacy Scripts",
        "items": [
          "Keep a symptom journal and bring it to appointments.",
          "Prepare a 30-second summary of your symptoms and history.",
          "Ask: 'What else could this be?' and 'Can we rule out a motility disorder?'",
          "Request documentation if denied tests or referrals."
        ]
      },
      {
        "title": "Chronic Illness Support",
        "items": [
          "@LittleMissDiagnosed on TikTok",
          "Facebook: 'Gastroparesis Support Group'",
          "YouTube: Chronically Jaquie (archived)",
          "Spoonie Subreddits: r/ChronicIllness, r/AskDocs"
        ]
      }
    ],
    "navigation": [
      {
        "text": "🔁 Start this story over from the beginning",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu (More stories coming soon!)",
        "nextId": "main_menu"
      }
    ]
  },
  "call_911": {
    "id": "call_911",
    "text": [
      "You groan something that sounds like 'Call 911' and collapse back onto the bathroom floor. Mitya grabs the phone.",
      "Now you wait... for the worst improv troupe in town: the paramedics."
    ],
    "choices": [
      {
        "text": "⏭️ Continue",
        "nextId": "paramedic_arrival"
      }
    ],
    "resources": [],
    "navigation": [
      {
        "text": "🔁 Restart Story",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu",
        "nextId": "main_menu"
      }
    ]
  },
  "partner_drive": {
    "id": "partner_drive",
    "text": [
      "You insist he can do it. He insists he can too. Neither of you believe it.",
      "He grabs the keys and limps to the car while you wobble behind him like a very sad zombie."
    ],
    "choices": [
      {
        "text": "⏭️ Continue",
        "nextId": "er_arrival_expanded"
      }
    ],
    "resources": [],
    "navigation": [
      {
        "text": "🔁 Restart Story",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu",
        "nextId": "main_menu"
      }
    ]
  },
  "bathroom_floor": {
    "id": "bathroom_floor",
    "text": [
      "You curl up on the floor, clutching a crusty yoga mat and pretending it’s doing something helpful.",
      "Surprise: it’s not. You can’t stop vomiting, and everything hurts.",
      "Eventually you’re forced to admit that dying on ceramic tile isn’t the vibe."
    ],
    "choices": [
      {
        "text": "Call 911 anyway",
        "nextId": "call_911"
      },
      {
        "text": "Crawl to the front door and let fate decide",
        "nextId": "paramedic_arrival"
      }
    ],
    "resources": [
      {
        "title": "How to Know When It's Time to Go to the ER",
        "url": "https://my.clevelandclinic.org/health/articles/9446-emergency-care"
      }
    ],
    "navigation": [
      {
        "text": "🔁 Restart Story",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu",
        "nextId": "main_menu"
      }
    ]
  }
}